Classes | Public Types | Public Member Functions | Friends | List of all members
ACAPI::DesignOptions::v1::DesignOptionCombinationViewSettings Class Reference
Design Options
A class that represents the design option combination settings of a view. More...
#include <DesignOptionCombinationViewSettings.hpp>
 Inheritance diagram for ACAPI::DesignOptions::v1::DesignOptionCombinationViewSettings:
 Classes
struct  | Custom
A type of combination that the user has modified, but did not give an explicit name. More...
struct  | MainModelOnly
A type of combination that has no design option connected to it, and only shows the main model. More...
struct  | Missing
A type of combination that does not exist, and was previously deleted. More...
struct  | Standard
A type of combination for which the user has selected a specific set of design options. More...
 Public Types
 using  | Status = std::variant< MainModelOnly, Standard, Custom, Missing >
Status of the view settings.
 Public Member Functions
GS::UniString  | GetName () const
Result< Status >  | GetStatus () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Modifies the view settings.
void  | SetMainModelOnly ()
Make the connected view to show only the main model.
void  | SetStandardCombination (const DesignOptionCombination &combination)
Make the connected view to show a selected design option combination.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Impl::DesignOptionManagerImpl
 class  | DesignOptionManager
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that represents the design option combination settings of a view.
Since
Archicad 27
Member Function Documentation
◆ GetName()
 GS::UniString ACAPI::DesignOptions::v1::DesignOptionCombinationViewSettings::GetName  |  ( |   | ) |   const
Returns
The name of a design option combination view setting.
◆ GetStatus()
 Result< Status > ACAPI::DesignOptions::v1::DesignOptionCombinationViewSettings::GetStatus  |  ( |   | ) |   const
Returns
The combination of the view setting.
Example code snippets from Test / Design Options
Get
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 for (const API_NavigatorItem& item : mapItems.Unwrap ()) {
 const ACAPI::Result<ACAPI::ModelViews::View> view = ACAPI::ModelViews::FindViewByGuid (item.guid);
 if (view.IsErr ()) {
 continue;
 }
 const ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings> settings =
 manager->GetDesignOptionCombinationSettingsOf (view.Unwrap ());
 if (settings.IsErr ()) {
 continue;
 }
 const ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Status> status = settings->GetStatus ();
 if (status.IsErr ()) {
 continue;
 }
 const GS::UniString itemId (item.uiId);
 const GS::UniString itemIdPrefix = !itemId.IsEmpty () ? itemId + " " : GS::EmptyUniString;
 const GS::UniString itemName (item.uName);
 const GS::UniString fullName = itemIdPrefix + itemName;
 std::visit (GS::Overloaded {
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::MainModelOnly&) {
 WriteReport ("%s: Main Model Only.", fullName.ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Standard& standard) {
 WriteReport ("%s: %s.", fullName.ToCStr ().Get (), standard.combination.GetName ().ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Custom& /*custom*/) {
 WriteReport ("%s: Custom.", fullName.ToCStr ().Get ());
 },
 [&fullName] (const ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Missing&) {
 WriteReport ("%s: Missing.", fullName.ToCStr ().Get ());
 },
 }, status.Unwrap ());
 }
◆ Modify()
 template<class ModifierFunc >
 Result< void > ACAPI::DesignOptions::v1::DesignOptionCombinationViewSettings::Modify  |  ( |  ModifierFunc &&  |  modifierFunc | )
Modifies the view settings.
Parameters
modifierFunc | The function that make the modifications.
Returns
Result of the modification.
◆ SetMainModelOnly()
 void ACAPI::DesignOptions::v1::DesignOptionCombinationViewSettings::SetMainModelOnly  |  ( |   | )
Make the connected view to show only the main model.
Example code snippets from Test / Design Options
 const ACAPI::Result<std::vector<API_NavigatorItem>> mapItems = GetLeafNavigatorItems (API_PublicViewMap);
 if (mapItems.IsErr ()) {
 WriteReport ("Failed to get navigator map items.");
 return;
 }
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionManager> manager = CreateDesignOptionManager ();
 if (manager.IsErr ()) {
 WriteReport ("Failed to get Design Option Manager.");
 return;
 }
 for (const API_NavigatorItem& item : mapItems.Unwrap ()) {
 const ACAPI::Result<ACAPI::ModelViews::View> view = ACAPI::ModelViews::FindViewByGuid (item.guid);
 if (view.IsErr ()) {
 continue;
 }
 ACAPI::Result<ACAPI::DesignOptions::DesignOptionCombinationViewSettings> settings =
 manager->GetDesignOptionCombinationSettingsOf (view.Unwrap ());
 if (settings.IsErr ()) {
 continue;
 }
 settings->Modify ([] (ACAPI::DesignOptions::DesignOptionCombinationViewSettings::Modifier& modifier) {
 modifier.SetMainModelOnly ();
 });
 }
◆ SetStandardCombination()
 void ACAPI::DesignOptions::v1::DesignOptionCombinationViewSettings::SetStandardCombination  |  ( |  const DesignOptionCombination &  |  combination | )
Make the connected view to show a selected design option combination.
The list of available combinations can be retrieved via DesignOptionManager::GetAvailableDesignOptionCombinations.
Parameters
combination | The combination to be set.